apache/nuttx/arch/arm/src/rp2040/hardware/rp2040_usbctrl_regs.h
/****************************************************************************
 * arch/arm/src/rp2040/hardware/rp2040_usbctrl_regs.h
 *
 * SPDX-License-Identifier: BSD-3-Clause
 * SPDX-FileCopyrightText: 2020 Raspberry Pi (Trading) Ltd.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in
 *    the documentation and/or other materials provided with the
 *    distribution.
 * 3. Neither the name of the copyright holder nor the names of its
 *    contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 ****************************************************************************/

#ifndef __ARCH_ARM_SRC_RP2040_HARDWARE_RP2040_USBCTRL_REGS_H
#define __ARCH_ARM_SRC_RP2040_HARDWARE_RP2040_USBCTRL_REGS_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include "hardware/rp2040_memorymap.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Register offsets *********************************************************/

#define RP2040_USBCTRL_REGS_ADDR_ENDP_OFFSET               0x000000  /* Device address and endpoint control */
#define RP2040_USBCTRL_REGS_ADDR_ENDPN_OFFSET(n)           (0x000004 + ((n) - 1) * 4)
                                                                     /* Interrupt endpoint 1. Only valid for HOST mode. */
#define RP2040_USBCTRL_REGS_MAIN_CTRL_OFFSET               0x000040  /* Main control register */
#define RP2040_USBCTRL_REGS_SOF_WR_OFFSET                  0x000044  /* Set the SOF (Start of Frame) frame number in the host controller. The SOF packet is sent every 1ms and the host will increment the frame number by 1 each time. */
#define RP2040_USBCTRL_REGS_SOF_RD_OFFSET                  0x000048  /* Read the last SOF (Start of Frame) frame number seen. In device mode the last SOF received from the host. In host mode the last SOF sent by the host. */
#define RP2040_USBCTRL_REGS_SIE_CTRL_OFFSET                0x00004c  /* SIE control register */
#define RP2040_USBCTRL_REGS_SIE_STATUS_OFFSET              0x000050  /* SIE status register */
#define RP2040_USBCTRL_REGS_INT_EP_CTRL_OFFSET             0x000054  /* interrupt endpoint control register */
#define RP2040_USBCTRL_REGS_BUFF_STATUS_OFFSET             0x000058  /* Buffer status register. A bit set here indicates that a buffer has completed on the endpoint (if the buffer interrupt is enabled). It is possible for 2 buffers to be completed, so clearing the buffer status bit may instantly re set it on the next clock cycle. */
#define RP2040_USBCTRL_REGS_BUFF_CPU_SHOULD_HANDLE_OFFSET  0x00005c  /* Which of the double buffers should be handled. Only valid if using an interrupt per buffer (i.e. not per 2 buffers). Not valid for host interrupt endpoint polling because they are only single buffered. */
#define RP2040_USBCTRL_REGS_EP_ABORT_OFFSET                0x000060  /* Device only: Can be set to ignore the buffer control register for this endpoint in case you would like to revoke a buffer. A NAK will be sent for every access to the endpoint until this bit is cleared. A corresponding bit in `EP_ABORT_DONE` is set when it is safe to modify the buffer control register. */
#define RP2040_USBCTRL_REGS_EP_ABORT_DONE_OFFSET           0x000064  /* Device only: Used in conjunction with `EP_ABORT`. Set once an endpoint is idle so the programmer knows it is safe to modify the buffer control register. */
#define RP2040_USBCTRL_REGS_EP_STALL_ARM_OFFSET            0x000068  /* Device: this bit must be set in conjunction with the `STALL` bit in the buffer control register to send a STALL on EP0. The device controller clears these bits when a SETUP packet is received because the USB spec requires that a STALL condition is cleared when a SETUP packet is received. */
#define RP2040_USBCTRL_REGS_NAK_POLL_OFFSET                0x00006c  /* Used by the host controller. Sets the wait time in microseconds before trying again if the device replies with a NAK. */
#define RP2040_USBCTRL_REGS_EP_STATUS_STALL_NAK_OFFSET     0x000070  /* Device: bits are set when the `IRQ_ON_NAK` or `IRQ_ON_STALL` bits are set. For EP0 this comes from `SIE_CTRL`. For all other endpoints it comes from the endpoint control register. */
#define RP2040_USBCTRL_REGS_USB_MUXING_OFFSET              0x000074  /* Where to connect the USB controller. Should be to_phy by default. */
#define RP2040_USBCTRL_REGS_USB_PWR_OFFSET                 0x000078  /* Overrides for the power signals in the event that the VBUS signals are not hooked up to GPIO. Set the value of the override and then the override enable to switch over to the override value. */
#define RP2040_USBCTRL_REGS_USBPHY_DIRECT_OFFSET           0x00007c  /* This register allows for direct control of the USB phy. Use in conjunction with usbphy_direct_override register to enable each override bit. */
#define RP2040_USBCTRL_REGS_USBPHY_DIRECT_OVERRIDE_OFFSET  0x000080  /* Override enable for each control in usbphy_direct */
#define RP2040_USBCTRL_REGS_USBPHY_TRIM_OFFSET             0x000084  /* Used to adjust trim values of USB phy pull down resistors. */
#define RP2040_USBCTRL_REGS_INTR_OFFSET                    0x00008c  /* Raw Interrupts */
#define RP2040_USBCTRL_REGS_INTE_OFFSET                    0x000090  /* Interrupt Enable */
#define RP2040_USBCTRL_REGS_INTF_OFFSET                    0x000094  /* Interrupt Force */
#define RP2040_USBCTRL_REGS_INTS_OFFSET                    0x000098  /* Interrupt status after masking & forcing */

/* Register definitions *****************************************************/

#define RP2040_USBCTRL_REGS_ADDR_ENDP               (RP2040_USBCTRL_REGS_BASE + RP2040_USBCTRL_REGS_ADDR_ENDP_OFFSET)
#define RP2040_USBCTRL_REGS_ADDR_ENDPN(n)           (RP2040_USBCTRL_REGS_BASE + RP2040_USBCTRL_REGS_ADDR_ENDPN_OFFSET(n))
#define RP2040_USBCTRL_REGS_MAIN_CTRL               (RP2040_USBCTRL_REGS_BASE + RP2040_USBCTRL_REGS_MAIN_CTRL_OFFSET)
#define RP2040_USBCTRL_REGS_SOF_WR                  (RP2040_USBCTRL_REGS_BASE + RP2040_USBCTRL_REGS_SOF_WR_OFFSET)
#define RP2040_USBCTRL_REGS_SOF_RD                  (RP2040_USBCTRL_REGS_BASE + RP2040_USBCTRL_REGS_SOF_RD_OFFSET)
#define RP2040_USBCTRL_REGS_SIE_CTRL                (RP2040_USBCTRL_REGS_BASE + RP2040_USBCTRL_REGS_SIE_CTRL_OFFSET)
#define RP2040_USBCTRL_REGS_SIE_STATUS              (RP2040_USBCTRL_REGS_BASE + RP2040_USBCTRL_REGS_SIE_STATUS_OFFSET)
#define RP2040_USBCTRL_REGS_INT_EP_CTRL             (RP2040_USBCTRL_REGS_BASE + RP2040_USBCTRL_REGS_INT_EP_CTRL_OFFSET)
#define RP2040_USBCTRL_REGS_BUFF_STATUS             (RP2040_USBCTRL_REGS_BASE + RP2040_USBCTRL_REGS_BUFF_STATUS_OFFSET)
#define RP2040_USBCTRL_REGS_BUFF_CPU_SHOULD_HANDLE  (RP2040_USBCTRL_REGS_BASE + RP2040_USBCTRL_REGS_BUFF_CPU_SHOULD_HANDLE_OFFSET)
#define RP2040_USBCTRL_REGS_EP_ABORT                (RP2040_USBCTRL_REGS_BASE + RP2040_USBCTRL_REGS_EP_ABORT_OFFSET)
#define RP2040_USBCTRL_REGS_EP_ABORT_DONE           (RP2040_USBCTRL_REGS_BASE + RP2040_USBCTRL_REGS_EP_ABORT_DONE_OFFSET)
#define RP2040_USBCTRL_REGS_EP_STALL_ARM            (RP2040_USBCTRL_REGS_BASE + RP2040_USBCTRL_REGS_EP_STALL_ARM_OFFSET)
#define RP2040_USBCTRL_REGS_NAK_POLL                (RP2040_USBCTRL_REGS_BASE + RP2040_USBCTRL_REGS_NAK_POLL_OFFSET)
#define RP2040_USBCTRL_REGS_EP_STATUS_STALL_NAK     (RP2040_USBCTRL_REGS_BASE + RP2040_USBCTRL_REGS_EP_STATUS_STALL_NAK_OFFSET)
#define RP2040_USBCTRL_REGS_USB_MUXING              (RP2040_USBCTRL_REGS_BASE + RP2040_USBCTRL_REGS_USB_MUXING_OFFSET)
#define RP2040_USBCTRL_REGS_USB_PWR                 (RP2040_USBCTRL_REGS_BASE + RP2040_USBCTRL_REGS_USB_PWR_OFFSET)
#define RP2040_USBCTRL_REGS_USBPHY_DIRECT           (RP2040_USBCTRL_REGS_BASE + RP2040_USBCTRL_REGS_USBPHY_DIRECT_OFFSET)
#define RP2040_USBCTRL_REGS_USBPHY_DIRECT_OVERRIDE  (RP2040_USBCTRL_REGS_BASE + RP2040_USBCTRL_REGS_USBPHY_DIRECT_OVERRIDE_OFFSET)
#define RP2040_USBCTRL_REGS_USBPHY_TRIM             (RP2040_USBCTRL_REGS_BASE + RP2040_USBCTRL_REGS_USBPHY_TRIM_OFFSET)
#define RP2040_USBCTRL_REGS_INTR                    (RP2040_USBCTRL_REGS_BASE + RP2040_USBCTRL_REGS_INTR_OFFSET)
#define RP2040_USBCTRL_REGS_INTE                    (RP2040_USBCTRL_REGS_BASE + RP2040_USBCTRL_REGS_INTE_OFFSET)
#define RP2040_USBCTRL_REGS_INTF                    (RP2040_USBCTRL_REGS_BASE + RP2040_USBCTRL_REGS_INTF_OFFSET)
#define RP2040_USBCTRL_REGS_INTS                    (RP2040_USBCTRL_REGS_BASE + RP2040_USBCTRL_REGS_INTS_OFFSET)

/* Register bit definitions *************************************************/

