apache/nuttx/arch/arm/src/rp2040/hardware/rp2040_usbctrl_regs.h
#define RP2040_USBCTRL_REGS_ADDR_ENDP_ENDPOINT_SHIFT                            (16)       /* Device endpoint to send data to. Only valid for HOST mode. */
#define RP2040_USBCTRL_REGS_ADDR_ENDP_ENDPOINT_MASK                             (0x0f << RP2040_USBCTRL_REGS_ADDR_ENDP_ENDPOINT_SHIFT)
#define RP2040_USBCTRL_REGS_ADDR_ENDP_ADDRESS_MASK                              (0x7f)     /* In device mode, the address that the device should respond to. Set in response to a SET_ADDR setup packet from the host. In host mode set to the address of the device to communicate with. */

#define RP2040_USBCTRL_REGS_ADDR_ENDPN_INTEP_PREAMBLE                           (1 << 26)  /* Interrupt EP requires preamble (is a low speed device on a full speed hub) */
#define RP2040_USBCTRL_REGS_ADDR_ENDPN_INTEP_DIR                                (1 << 25)  /* Direction of the interrupt endpoint. In=0, Out=1 */
#define RP2040_USBCTRL_REGS_ADDR_ENDPN_ENDPOINT_SHIFT                           (16)       /* Endpoint number of the interrupt endpoint */
#define RP2040_USBCTRL_REGS_ADDR_ENDPN_ENDPOINT_MASK                            (0x0f << RP2040_USBCTRL_REGS_ADDR_ENDP1_ENDPOINT_SHIFT)
#define RP2040_USBCTRL_REGS_ADDR_ENDPN_ADDRESS_MASK                             (0x7f)     /* Device address */

#define RP2040_USBCTRL_REGS_MAIN_CTRL_SIM_TIMING                                (1 << 31)  /* Reduced timings for simulation */
#define RP2040_USBCTRL_REGS_MAIN_CTRL_HOST_NDEVICE                              (1 << 1)   /* Device mode = 0, Host mode = 1 */
#define RP2040_USBCTRL_REGS_MAIN_CTRL_CONTROLLER_EN                             (1 << 0)   /* Enable controller */

#define RP2040_USBCTRL_REGS_SOF_WR_COUNT_MASK                                   (0x7ff)

#define RP2040_USBCTRL_REGS_SOF_RD_COUNT_MASK                                   (0x7ff)

#define RP2040_USBCTRL_REGS_SIE_CTRL_EP0_INT_STALL                              (1 << 31)  /* Device: Set bit in EP_STATUS_STALL_NAK when EP0 sends a STALL */
#define RP2040_USBCTRL_REGS_SIE_CTRL_EP0_DOUBLE_BUF                             (1 << 30)  /* Device: EP0 single buffered = 0, double buffered = 1 */
#define RP2040_USBCTRL_REGS_SIE_CTRL_EP0_INT_1BUF                               (1 << 29)  /* Device: Set bit in BUFF_STATUS for every buffer completed on EP0 */
#define RP2040_USBCTRL_REGS_SIE_CTRL_EP0_INT_2BUF                               (1 << 28)  /* Device: Set bit in BUFF_STATUS for every 2 buffers completed on EP0 */
#define RP2040_USBCTRL_REGS_SIE_CTRL_EP0_INT_NAK                                (1 << 27)  /* Device: Set bit in EP_STATUS_STALL_NAK when EP0 sends a NAK */
#define RP2040_USBCTRL_REGS_SIE_CTRL_DIRECT_EN                                  (1 << 26)  /* Direct bus drive enable */
#define RP2040_USBCTRL_REGS_SIE_CTRL_DIRECT_DP                                  (1 << 25)  /* Direct control of DP */
#define RP2040_USBCTRL_REGS_SIE_CTRL_DIRECT_DM                                  (1 << 24)  /* Direct control of DM */
#define RP2040_USBCTRL_REGS_SIE_CTRL_TRANSCEIVER_PD                             (1 << 18)  /* Power down bus transceiver */
#define RP2040_USBCTRL_REGS_SIE_CTRL_RPU_OPT                                    (1 << 17)  /* Device: Pull-up strength (0=1K2, 1=2k3) */
#define RP2040_USBCTRL_REGS_SIE_CTRL_PULLUP_EN                                  (1 << 16)  /* Device: Enable pull up resistor */
#define RP2040_USBCTRL_REGS_SIE_CTRL_PULLDOWN_EN                                (1 << 15)  /* Host: Enable pull down resistors */
#define RP2040_USBCTRL_REGS_SIE_CTRL_RESET_BUS                                  (1 << 13)  /* Host: Reset bus */
#define RP2040_USBCTRL_REGS_SIE_CTRL_RESUME                                     (1 << 12)  /* Device: Remote wakeup. Device can initiate its own resume after suspend. */
#define RP2040_USBCTRL_REGS_SIE_CTRL_VBUS_EN                                    (1 << 11)  /* Host: Enable VBUS */
#define RP2040_USBCTRL_REGS_SIE_CTRL_KEEP_ALIVE_EN                              (1 << 10)  /* Host: Enable keep alive packet (for low speed bus) */
#define RP2040_USBCTRL_REGS_SIE_CTRL_SOF_EN                                     (1 << 9)   /* Host: Enable SOF generation (for full speed bus) */
#define RP2040_USBCTRL_REGS_SIE_CTRL_SOF_SYNC                                   (1 << 8)   /* Host: Delay packet(s) until after SOF */
#define RP2040_USBCTRL_REGS_SIE_CTRL_PREAMBLE_EN                                (1 << 6)   /* Host: Preable enable for LS device on FS hub */
#define RP2040_USBCTRL_REGS_SIE_CTRL_STOP_TRANS                                 (1 << 4)   /* Host: Stop transaction */
#define RP2040_USBCTRL_REGS_SIE_CTRL_RECEIVE_DATA                               (1 << 3)   /* Host: Receive transaction (IN to host) */
#define RP2040_USBCTRL_REGS_SIE_CTRL_SEND_DATA                                  (1 << 2)   /* Host: Send transaction (OUT from host) */
#define RP2040_USBCTRL_REGS_SIE_CTRL_SEND_SETUP                                 (1 << 1)   /* Host: Send Setup packet */
#define RP2040_USBCTRL_REGS_SIE_CTRL_START_TRANS                                (1 << 0)   /* Host: Start transaction */

#define RP2040_USBCTRL_REGS_SIE_STATUS_DATA_SEQ_ERROR                           (1 << 31)  /* Data Sequence Error. */
#define RP2040_USBCTRL_REGS_SIE_STATUS_ACK_REC                                  (1 << 30)  /* ACK received. Raised by both host and device. */
#define RP2040_USBCTRL_REGS_SIE_STATUS_STALL_REC                                (1 << 29)  /* Host: STALL received */
#define RP2040_USBCTRL_REGS_SIE_STATUS_NAK_REC                                  (1 << 28)  /* Host: NAK received */
#define RP2040_USBCTRL_REGS_SIE_STATUS_RX_TIMEOUT                               (1 << 27)  /* RX timeout is raised by both the host and device if an ACK is not received in the maximum time specified by the USB spec. */
#define RP2040_USBCTRL_REGS_SIE_STATUS_RX_OVERFLOW                              (1 << 26)  /* RX overflow is raised by the Serial RX engine if the incoming data is too fast. */
#define RP2040_USBCTRL_REGS_SIE_STATUS_BIT_STUFF_ERROR                          (1 << 25)  /* Bit Stuff Error. Raised by the Serial RX engine. */
#define RP2040_USBCTRL_REGS_SIE_STATUS_CRC_ERROR                                (1 << 24)  /* CRC Error. Raised by the Serial RX engine. */
#define RP2040_USBCTRL_REGS_SIE_STATUS_BUS_RESET                                (1 << 19)  /* Device: bus reset received */
#define RP2040_USBCTRL_REGS_SIE_STATUS_TRANS_COMPLETE                           (1 << 18)  /* Transaction complete. */
#define RP2040_USBCTRL_REGS_SIE_STATUS_SETUP_REC                                (1 << 17)  /* Device: Setup packet received */
#define RP2040_USBCTRL_REGS_SIE_STATUS_CONNECTED                                (1 << 16)  /* Device: connected */
#define RP2040_USBCTRL_REGS_SIE_STATUS_RESUME                                   (1 << 11)  /* Host: Device has initiated a remote resume. Device: host has initiated a resume. */
#define RP2040_USBCTRL_REGS_SIE_STATUS_VBUS_OVER_CURR                           (1 << 10)  /* VBUS over current detected */
#define RP2040_USBCTRL_REGS_SIE_STATUS_SPEED_SHIFT                              (8)        /* Host: device speed. Disconnected = 00, LS = 01, FS = 10 */
#define RP2040_USBCTRL_REGS_SIE_STATUS_SPEED_MASK                               (0x03 << RP2040_USBCTRL_REGS_SIE_STATUS_SPEED_SHIFT)
#define RP2040_USBCTRL_REGS_SIE_STATUS_SUSPENDED                                (1 << 4)   /* Bus in suspended state. Valid for device and host. Host and device will go into suspend if neither Keep Alive / SOF frames are enabled. */
#define RP2040_USBCTRL_REGS_SIE_STATUS_LINE_STATE_SHIFT                         (2)        /* USB bus line state */
#define RP2040_USBCTRL_REGS_SIE_STATUS_LINE_STATE_MASK                          (0x03 << RP2040_USBCTRL_REGS_SIE_STATUS_LINE_STATE_SHIFT)
#define RP2040_USBCTRL_REGS_SIE_STATUS_VBUS_DETECTED                            (1 << 0)   /* Device: VBUS Detected */

