apache/nuttx/arch/arm/src/rp2040/hardware/rp2040_usbctrl_regs.h
#define RP2040_USBCTRL_REGS_INT_EP_CTRL_INT_EP_ACTIVE_SHIFT                     (1)        /* Host: Enable interrupt endpoint 1 -> 15 */
#define RP2040_USBCTRL_REGS_INT_EP_CTRL_INT_EP_ACTIVE_MASK                      (0x7fff << RP2040_USBCTRL_REGS_INT_EP_CTRL_INT_EP_ACTIVE_SHIFT)

#define RP2040_USBCTRL_REGS_BUFF_STATUS_EP15_OUT                                (1 << 31)
#define RP2040_USBCTRL_REGS_BUFF_STATUS_EP15_IN                                 (1 << 30)
#define RP2040_USBCTRL_REGS_BUFF_STATUS_EP14_OUT                                (1 << 29)
#define RP2040_USBCTRL_REGS_BUFF_STATUS_EP14_IN                                 (1 << 28)
#define RP2040_USBCTRL_REGS_BUFF_STATUS_EP13_OUT                                (1 << 27)
#define RP2040_USBCTRL_REGS_BUFF_STATUS_EP13_IN                                 (1 << 26)
#define RP2040_USBCTRL_REGS_BUFF_STATUS_EP12_OUT                                (1 << 25)
#define RP2040_USBCTRL_REGS_BUFF_STATUS_EP12_IN                                 (1 << 24)
#define RP2040_USBCTRL_REGS_BUFF_STATUS_EP11_OUT                                (1 << 23)
#define RP2040_USBCTRL_REGS_BUFF_STATUS_EP11_IN                                 (1 << 22)
#define RP2040_USBCTRL_REGS_BUFF_STATUS_EP10_OUT                                (1 << 21)
#define RP2040_USBCTRL_REGS_BUFF_STATUS_EP10_IN                                 (1 << 20)
#define RP2040_USBCTRL_REGS_BUFF_STATUS_EP9_OUT                                 (1 << 19)
#define RP2040_USBCTRL_REGS_BUFF_STATUS_EP9_IN                                  (1 << 18)
#define RP2040_USBCTRL_REGS_BUFF_STATUS_EP8_OUT                                 (1 << 17)
#define RP2040_USBCTRL_REGS_BUFF_STATUS_EP8_IN                                  (1 << 16)
#define RP2040_USBCTRL_REGS_BUFF_STATUS_EP7_OUT                                 (1 << 15)
#define RP2040_USBCTRL_REGS_BUFF_STATUS_EP7_IN                                  (1 << 14)
#define RP2040_USBCTRL_REGS_BUFF_STATUS_EP6_OUT                                 (1 << 13)
#define RP2040_USBCTRL_REGS_BUFF_STATUS_EP6_IN                                  (1 << 12)
#define RP2040_USBCTRL_REGS_BUFF_STATUS_EP5_OUT                                 (1 << 11)
#define RP2040_USBCTRL_REGS_BUFF_STATUS_EP5_IN                                  (1 << 10)
#define RP2040_USBCTRL_REGS_BUFF_STATUS_EP4_OUT                                 (1 << 9)
#define RP2040_USBCTRL_REGS_BUFF_STATUS_EP4_IN                                  (1 << 8)
#define RP2040_USBCTRL_REGS_BUFF_STATUS_EP3_OUT                                 (1 << 7)
#define RP2040_USBCTRL_REGS_BUFF_STATUS_EP3_IN                                  (1 << 6)
#define RP2040_USBCTRL_REGS_BUFF_STATUS_EP2_OUT                                 (1 << 5)
#define RP2040_USBCTRL_REGS_BUFF_STATUS_EP2_IN                                  (1 << 4)
#define RP2040_USBCTRL_REGS_BUFF_STATUS_EP1_OUT                                 (1 << 3)
#define RP2040_USBCTRL_REGS_BUFF_STATUS_EP1_IN                                  (1 << 2)
#define RP2040_USBCTRL_REGS_BUFF_STATUS_EP0_OUT                                 (1 << 1)
#define RP2040_USBCTRL_REGS_BUFF_STATUS_EP0_IN                                  (1 << 0)

#define RP2040_USBCTRL_REGS_BUFF_CPU_SHOULD_HANDLE_EP15_OUT                     (1 << 31)
#define RP2040_USBCTRL_REGS_BUFF_CPU_SHOULD_HANDLE_EP15_IN                      (1 << 30)
#define RP2040_USBCTRL_REGS_BUFF_CPU_SHOULD_HANDLE_EP14_OUT                     (1 << 29)
#define RP2040_USBCTRL_REGS_BUFF_CPU_SHOULD_HANDLE_EP14_IN                      (1 << 28)
#define RP2040_USBCTRL_REGS_BUFF_CPU_SHOULD_HANDLE_EP13_OUT                     (1 << 27)
#define RP2040_USBCTRL_REGS_BUFF_CPU_SHOULD_HANDLE_EP13_IN                      (1 << 26)
#define RP2040_USBCTRL_REGS_BUFF_CPU_SHOULD_HANDLE_EP12_OUT                     (1 << 25)
#define RP2040_USBCTRL_REGS_BUFF_CPU_SHOULD_HANDLE_EP12_IN                      (1 << 24)
#define RP2040_USBCTRL_REGS_BUFF_CPU_SHOULD_HANDLE_EP11_OUT                     (1 << 23)
#define RP2040_USBCTRL_REGS_BUFF_CPU_SHOULD_HANDLE_EP11_IN                      (1 << 22)
#define RP2040_USBCTRL_REGS_BUFF_CPU_SHOULD_HANDLE_EP10_OUT                     (1 << 21)
#define RP2040_USBCTRL_REGS_BUFF_CPU_SHOULD_HANDLE_EP10_IN                      (1 << 20)
#define RP2040_USBCTRL_REGS_BUFF_CPU_SHOULD_HANDLE_EP9_OUT                      (1 << 19)
#define RP2040_USBCTRL_REGS_BUFF_CPU_SHOULD_HANDLE_EP9_IN                       (1 << 18)
#define RP2040_USBCTRL_REGS_BUFF_CPU_SHOULD_HANDLE_EP8_OUT                      (1 << 17)
#define RP2040_USBCTRL_REGS_BUFF_CPU_SHOULD_HANDLE_EP8_IN                       (1 << 16)
#define RP2040_USBCTRL_REGS_BUFF_CPU_SHOULD_HANDLE_EP7_OUT                      (1 << 15)
#define RP2040_USBCTRL_REGS_BUFF_CPU_SHOULD_HANDLE_EP7_IN                       (1 << 14)
#define RP2040_USBCTRL_REGS_BUFF_CPU_SHOULD_HANDLE_EP6_OUT                      (1 << 13)
#define RP2040_USBCTRL_REGS_BUFF_CPU_SHOULD_HANDLE_EP6_IN                       (1 << 12)
#define RP2040_USBCTRL_REGS_BUFF_CPU_SHOULD_HANDLE_EP5_OUT                      (1 << 11)
#define RP2040_USBCTRL_REGS_BUFF_CPU_SHOULD_HANDLE_EP5_IN                       (1 << 10)
#define RP2040_USBCTRL_REGS_BUFF_CPU_SHOULD_HANDLE_EP4_OUT                      (1 << 9)
#define RP2040_USBCTRL_REGS_BUFF_CPU_SHOULD_HANDLE_EP4_IN                       (1 << 8)
#define RP2040_USBCTRL_REGS_BUFF_CPU_SHOULD_HANDLE_EP3_OUT                      (1 << 7)
#define RP2040_USBCTRL_REGS_BUFF_CPU_SHOULD_HANDLE_EP3_IN                       (1 << 6)
#define RP2040_USBCTRL_REGS_BUFF_CPU_SHOULD_HANDLE_EP2_OUT                      (1 << 5)
#define RP2040_USBCTRL_REGS_BUFF_CPU_SHOULD_HANDLE_EP2_IN                       (1 << 4)
#define RP2040_USBCTRL_REGS_BUFF_CPU_SHOULD_HANDLE_EP1_OUT                      (1 << 3)
#define RP2040_USBCTRL_REGS_BUFF_CPU_SHOULD_HANDLE_EP1_IN                       (1 << 2)
#define RP2040_USBCTRL_REGS_BUFF_CPU_SHOULD_HANDLE_EP0_OUT                      (1 << 1)
#define RP2040_USBCTRL_REGS_BUFF_CPU_SHOULD_HANDLE_EP0_IN                       (1 << 0)

#define RP2040_USBCTRL_REGS_EP_ABORT_EP15_OUT                                   (1 << 31)
#define RP2040_USBCTRL_REGS_EP_ABORT_EP15_IN                                    (1 << 30)
#define RP2040_USBCTRL_REGS_EP_ABORT_EP14_OUT                                   (1 << 29)
#define RP2040_USBCTRL_REGS_EP_ABORT_EP14_IN                                    (1 << 28)
#define RP2040_USBCTRL_REGS_EP_ABORT_EP13_OUT                                   (1 << 27)
#define RP2040_USBCTRL_REGS_EP_ABORT_EP13_IN                                    (1 << 26)
#define RP2040_USBCTRL_REGS_EP_ABORT_EP12_OUT                                   (1 << 25)
#define RP2040_USBCTRL_REGS_EP_ABORT_EP12_IN                                    (1 << 24)
#define RP2040_USBCTRL_REGS_EP_ABORT_EP11_OUT                                   (1 << 23)
#define RP2040_USBCTRL_REGS_EP_ABORT_EP11_IN                                    (1 << 22)
#define RP2040_USBCTRL_REGS_EP_ABORT_EP10_OUT                                   (1 << 21)
#define RP2040_USBCTRL_REGS_EP_ABORT_EP10_IN                                    (1 << 20)
#define RP2040_USBCTRL_REGS_EP_ABORT_EP9_OUT                                    (1 << 19)
#define RP2040_USBCTRL_REGS_EP_ABORT_EP9_IN                                     (1 << 18)
#define RP2040_USBCTRL_REGS_EP_ABORT_EP8_OUT                                    (1 << 17)
#define RP2040_USBCTRL_REGS_EP_ABORT_EP8_IN                                     (1 << 16)
#define RP2040_USBCTRL_REGS_EP_ABORT_EP7_OUT                                    (1 << 15)
#define RP2040_USBCTRL_REGS_EP_ABORT_EP7_IN                                     (1 << 14)
#define RP2040_USBCTRL_REGS_EP_ABORT_EP6_OUT                                    (1 << 13)
#define RP2040_USBCTRL_REGS_EP_ABORT_EP6_IN                                     (1 << 12)
#define RP2040_USBCTRL_REGS_EP_ABORT_EP5_OUT                                    (1 << 11)
#define RP2040_USBCTRL_REGS_EP_ABORT_EP5_IN                                     (1 << 10)
#define RP2040_USBCTRL_REGS_EP_ABORT_EP4_OUT                                    (1 << 9)
#define RP2040_USBCTRL_REGS_EP_ABORT_EP4_IN                                     (1 << 8)
#define RP2040_USBCTRL_REGS_EP_ABORT_EP3_OUT                                    (1 << 7)
#define RP2040_USBCTRL_REGS_EP_ABORT_EP3_IN                                     (1 << 6)
#define RP2040_USBCTRL_REGS_EP_ABORT_EP2_OUT                                    (1 << 5)
#define RP2040_USBCTRL_REGS_EP_ABORT_EP2_IN                                     (1 << 4)
#define RP2040_USBCTRL_REGS_EP_ABORT_EP1_OUT                                    (1 << 3)
#define RP2040_USBCTRL_REGS_EP_ABORT_EP1_IN                                     (1 << 2)
#define RP2040_USBCTRL_REGS_EP_ABORT_EP0_OUT                                    (1 << 1)
#define RP2040_USBCTRL_REGS_EP_ABORT_EP0_IN                                     (1 << 0)

#define RP2040_USBCTRL_REGS_EP_ABORT_DONE_EP15_OUT                              (1 << 31)
#define RP2040_USBCTRL_REGS_EP_ABORT_DONE_EP15_IN                               (1 << 30)
#define RP2040_USBCTRL_REGS_EP_ABORT_DONE_EP14_OUT                              (1 << 29)
#define RP2040_USBCTRL_REGS_EP_ABORT_DONE_EP14_IN                               (1 << 28)
#define RP2040_USBCTRL_REGS_EP_ABORT_DONE_EP13_OUT                              (1 << 27)
#define RP2040_USBCTRL_REGS_EP_ABORT_DONE_EP13_IN                               (1 << 26)
#define RP2040_USBCTRL_REGS_EP_ABORT_DONE_EP12_OUT                              (1 << 25)
#define RP2040_USBCTRL_REGS_EP_ABORT_DONE_EP12_IN                               (1 << 24)
#define RP2040_USBCTRL_REGS_EP_ABORT_DONE_EP11_OUT                              (1 << 23)
#define RP2040_USBCTRL_REGS_EP_ABORT_DONE_EP11_IN                               (1 << 22)
#define RP2040_USBCTRL_REGS_EP_ABORT_DONE_EP10_OUT                              (1 << 21)
#define RP2040_USBCTRL_REGS_EP_ABORT_DONE_EP10_IN                               (1 << 20)
#define RP2040_USBCTRL_REGS_EP_ABORT_DONE_EP9_OUT                               (1 << 19)
#define RP2040_USBCTRL_REGS_EP_ABORT_DONE_EP9_IN                                (1 << 18)
#define RP2040_USBCTRL_REGS_EP_ABORT_DONE_EP8_OUT                               (1 << 17)
#define RP2040_USBCTRL_REGS_EP_ABORT_DONE_EP8_IN                                (1 << 16)
#define RP2040_USBCTRL_REGS_EP_ABORT_DONE_EP7_OUT                               (1 << 15)
#define RP2040_USBCTRL_REGS_EP_ABORT_DONE_EP7_IN                                (1 << 14)
#define RP2040_USBCTRL_REGS_EP_ABORT_DONE_EP6_OUT                               (1 << 13)
#define RP2040_USBCTRL_REGS_EP_ABORT_DONE_EP6_IN                                (1 << 12)
#define RP2040_USBCTRL_REGS_EP_ABORT_DONE_EP5_OUT                               (1 << 11)
#define RP2040_USBCTRL_REGS_EP_ABORT_DONE_EP5_IN                                (1 << 10)
#define RP2040_USBCTRL_REGS_EP_ABORT_DONE_EP4_OUT                               (1 << 9)
#define RP2040_USBCTRL_REGS_EP_ABORT_DONE_EP4_IN                                (1 << 8)
#define RP2040_USBCTRL_REGS_EP_ABORT_DONE_EP3_OUT                               (1 << 7)
#define RP2040_USBCTRL_REGS_EP_ABORT_DONE_EP3_IN                                (1 << 6)
#define RP2040_USBCTRL_REGS_EP_ABORT_DONE_EP2_OUT                               (1 << 5)
#define RP2040_USBCTRL_REGS_EP_ABORT_DONE_EP2_IN                                (1 << 4)
#define RP2040_USBCTRL_REGS_EP_ABORT_DONE_EP1_OUT                               (1 << 3)
#define RP2040_USBCTRL_REGS_EP_ABORT_DONE_EP1_IN                                (1 << 2)
#define RP2040_USBCTRL_REGS_EP_ABORT_DONE_EP0_OUT                               (1 << 1)
#define RP2040_USBCTRL_REGS_EP_ABORT_DONE_EP0_IN                                (1 << 0)

#define RP2040_USBCTRL_REGS_EP_STALL_ARM_EP0_OUT                                (1 << 1)
#define RP2040_USBCTRL_REGS_EP_STALL_ARM_EP0_IN                                 (1 << 0)

#define RP2040_USBCTRL_REGS_NAK_POLL_DELAY_FS_SHIFT                             (16)     /* NAK polling interval for a full speed device */
#define RP2040_USBCTRL_REGS_NAK_POLL_DELAY_FS_MASK                              (0x3ff << RP2040_USBCTRL_REGS_NAK_POLL_DELAY_FS_SHIFT)
#define RP2040_USBCTRL_REGS_NAK_POLL_DELAY_LS_MASK                              (0x3ff)  /* NAK polling interval for a low speed device */

#define RP2040_USBCTRL_REGS_EP_STATUS_STALL_NAK_EP15_OUT                        (1 << 31)
#define RP2040_USBCTRL_REGS_EP_STATUS_STALL_NAK_EP15_IN                         (1 << 30)
#define RP2040_USBCTRL_REGS_EP_STATUS_STALL_NAK_EP14_OUT                        (1 << 29)
#define RP2040_USBCTRL_REGS_EP_STATUS_STALL_NAK_EP14_IN                         (1 << 28)
#define RP2040_USBCTRL_REGS_EP_STATUS_STALL_NAK_EP13_OUT                        (1 << 27)
#define RP2040_USBCTRL_REGS_EP_STATUS_STALL_NAK_EP13_IN                         (1 << 26)
#define RP2040_USBCTRL_REGS_EP_STATUS_STALL_NAK_EP12_OUT                        (1 << 25)
#define RP2040_USBCTRL_REGS_EP_STATUS_STALL_NAK_EP12_IN                         (1 << 24)
#define RP2040_USBCTRL_REGS_EP_STATUS_STALL_NAK_EP11_OUT                        (1 << 23)
#define RP2040_USBCTRL_REGS_EP_STATUS_STALL_NAK_EP11_IN                         (1 << 22)
#define RP2040_USBCTRL_REGS_EP_STATUS_STALL_NAK_EP10_OUT                        (1 << 21)
#define RP2040_USBCTRL_REGS_EP_STATUS_STALL_NAK_EP10_IN                         (1 << 20)
#define RP2040_USBCTRL_REGS_EP_STATUS_STALL_NAK_EP9_OUT                         (1 << 19)
#define RP2040_USBCTRL_REGS_EP_STATUS_STALL_NAK_EP9_IN                          (1 << 18)
#define RP2040_USBCTRL_REGS_EP_STATUS_STALL_NAK_EP8_OUT                         (1 << 17)
#define RP2040_USBCTRL_REGS_EP_STATUS_STALL_NAK_EP8_IN                          (1 << 16)
#define RP2040_USBCTRL_REGS_EP_STATUS_STALL_NAK_EP7_OUT                         (1 << 15)
#define RP2040_USBCTRL_REGS_EP_STATUS_STALL_NAK_EP7_IN                          (1 << 14)
#define RP2040_USBCTRL_REGS_EP_STATUS_STALL_NAK_EP6_OUT                         (1 << 13)
#define RP2040_USBCTRL_REGS_EP_STATUS_STALL_NAK_EP6_IN                          (1 << 12)
#define RP2040_USBCTRL_REGS_EP_STATUS_STALL_NAK_EP5_OUT                         (1 << 11)
#define RP2040_USBCTRL_REGS_EP_STATUS_STALL_NAK_EP5_IN                          (1 << 10)
#define RP2040_USBCTRL_REGS_EP_STATUS_STALL_NAK_EP4_OUT                         (1 << 9)
#define RP2040_USBCTRL_REGS_EP_STATUS_STALL_NAK_EP4_IN                          (1 << 8)
#define RP2040_USBCTRL_REGS_EP_STATUS_STALL_NAK_EP3_OUT                         (1 << 7)
#define RP2040_USBCTRL_REGS_EP_STATUS_STALL_NAK_EP3_IN                          (1 << 6)
#define RP2040_USBCTRL_REGS_EP_STATUS_STALL_NAK_EP2_OUT                         (1 << 5)
#define RP2040_USBCTRL_REGS_EP_STATUS_STALL_NAK_EP2_IN                          (1 << 4)
#define RP2040_USBCTRL_REGS_EP_STATUS_STALL_NAK_EP1_OUT                         (1 << 3)
#define RP2040_USBCTRL_REGS_EP_STATUS_STALL_NAK_EP1_IN                          (1 << 2)
#define RP2040_USBCTRL_REGS_EP_STATUS_STALL_NAK_EP0_OUT                         (1 << 1)
#define RP2040_USBCTRL_REGS_EP_STATUS_STALL_NAK_EP0_IN                          (1 << 0)

#define RP2040_USBCTRL_REGS_USB_MUXING_SOFTCON                                  (1 << 3)
#define RP2040_USBCTRL_REGS_USB_MUXING_TO_DIGITAL_PAD                           (1 << 2)
#define RP2040_USBCTRL_REGS_USB_MUXING_TO_EXTPHY                                (1 << 1)
#define RP2040_USBCTRL_REGS_USB_MUXING_TO_PHY                                   (1 << 0)

#define RP2040_USBCTRL_REGS_USB_PWR_OVERCURR_DETECT_EN                          (1 << 5)
#define RP2040_USBCTRL_REGS_USB_PWR_OVERCURR_DETECT                             (1 << 4)
#define RP2040_USBCTRL_REGS_USB_PWR_VBUS_DETECT_OVERRIDE_EN                     (1 << 3)
#define RP2040_USBCTRL_REGS_USB_PWR_VBUS_DETECT                                 (1 << 2)
#define RP2040_USBCTRL_REGS_USB_PWR_VBUS_EN_OVERRIDE_EN                         (1 << 1)
#define RP2040_USBCTRL_REGS_USB_PWR_VBUS_EN                                     (1 << 0)

#define RP2040_USBCTRL_REGS_USBPHY_DIRECT_DM_OVV                                (1 << 22)  /* DM over voltage */
#define RP2040_USBCTRL_REGS_USBPHY_DIRECT_DP_OVV                                (1 << 21)  /* DP over voltage */
#define RP2040_USBCTRL_REGS_USBPHY_DIRECT_DM_OVCN                               (1 << 20)  /* DM overcurrent */
#define RP2040_USBCTRL_REGS_USBPHY_DIRECT_DP_OVCN                               (1 << 19)  /* DP overcurrent */
#define RP2040_USBCTRL_REGS_USBPHY_DIRECT_RX_DM                                 (1 << 18)  /* DPM pin state */
#define RP2040_USBCTRL_REGS_USBPHY_DIRECT_RX_DP                                 (1 << 17)  /* DPP pin state */
#define RP2040_USBCTRL_REGS_USBPHY_DIRECT_RX_DD                                 (1 << 16)  /* Differential RX */
#define RP2040_USBCTRL_REGS_USBPHY_DIRECT_TX_DIFFMODE                           (1 << 15)  /* TX_DIFFMODE=0: Single ended mode TX_DIFFMODE=1: Differential drive mode (TX_DM, TX_DM_OE ignored) */
#define RP2040_USBCTRL_REGS_USBPHY_DIRECT_TX_FSSLEW                             (1 << 14)  /* TX_FSSLEW=0: Low speed slew rate TX_FSSLEW=1: Full speed slew rate */
#define RP2040_USBCTRL_REGS_USBPHY_DIRECT_TX_PD                                 (1 << 13)  /* TX power down override (if override enable is set). 1 = powered down. */
#define RP2040_USBCTRL_REGS_USBPHY_DIRECT_RX_PD                                 (1 << 12)  /* RX power down override (if override enable is set). 1 = powered down. */
#define RP2040_USBCTRL_REGS_USBPHY_DIRECT_TX_DM                                 (1 << 11)  /* Output data. TX_DIFFMODE=1, Ignored TX_DIFFMODE=0, Drives DPM only. TX_DM_OE=1 to enable drive. DPM=TX_DM */
#define RP2040_USBCTRL_REGS_USBPHY_DIRECT_TX_DP                                 (1 << 10)  /* Output data. If TX_DIFFMODE=1, Drives DPP/DPM diff pair. TX_DP_OE=1 to enable drive. DPP=TX_DP, DPM=~TX_DP If TX_DIFFMODE=0, Drives DPP only. TX_DP_OE=1 to enable drive. DPP=TX_DP */
#define RP2040_USBCTRL_REGS_USBPHY_DIRECT_TX_DM_OE                              (1 << 9)   /* Output enable. If TX_DIFFMODE=1, Ignored. If TX_DIFFMODE=0, OE for DPM only. 0 - DPM in Hi-Z state; 1 - DPM driving */
#define RP2040_USBCTRL_REGS_USBPHY_DIRECT_TX_DP_OE                              (1 << 8)   /* Output enable. If TX_DIFFMODE=1, OE for DPP/DPM diff pair. 0 - DPP/DPM in Hi-Z state; 1 - DPP/DPM driving If TX_DIFFMODE=0, OE for DPP only. 0 - DPP in Hi-Z state; 1 - DPP driving */
#define RP2040_USBCTRL_REGS_USBPHY_DIRECT_DM_PULLDN_EN                          (1 << 6)   /* DM pull down enable */
#define RP2040_USBCTRL_REGS_USBPHY_DIRECT_DM_PULLUP_EN                          (1 << 5)   /* DM pull up enable */
#define RP2040_USBCTRL_REGS_USBPHY_DIRECT_DM_PULLUP_HISEL                       (1 << 4)   /* Enable the second DM pull up resistor. 0 - Pull = Rpu2; 1 - Pull = Rpu1 + Rpu2 */
#define RP2040_USBCTRL_REGS_USBPHY_DIRECT_DP_PULLDN_EN                          (1 << 2)   /* DP pull down enable */
#define RP2040_USBCTRL_REGS_USBPHY_DIRECT_DP_PULLUP_EN                          (1 << 1)   /* DP pull up enable */
#define RP2040_USBCTRL_REGS_USBPHY_DIRECT_DP_PULLUP_HISEL                       (1 << 0)   /* Enable the second DP pull up resistor. 0 - Pull = Rpu2; 1 - Pull = Rpu1 + Rpu2 */

