apache/nuttx/arch/arm/src/rp2040/hardware/rp2040_usbctrl_regs.h
#define RP2040_USBCTRL_REGS_USBPHY_DIRECT_OVERRIDE_TX_DIFFMODE_OVERRIDE_EN      (1 << 15)
#define RP2040_USBCTRL_REGS_USBPHY_DIRECT_OVERRIDE_DM_PULLUP_OVERRIDE_EN        (1 << 12)
#define RP2040_USBCTRL_REGS_USBPHY_DIRECT_OVERRIDE_TX_FSSLEW_OVERRIDE_EN        (1 << 11)
#define RP2040_USBCTRL_REGS_USBPHY_DIRECT_OVERRIDE_TX_PD_OVERRIDE_EN            (1 << 10)
#define RP2040_USBCTRL_REGS_USBPHY_DIRECT_OVERRIDE_RX_PD_OVERRIDE_EN            (1 << 9)
#define RP2040_USBCTRL_REGS_USBPHY_DIRECT_OVERRIDE_TX_DM_OVERRIDE_EN            (1 << 8)
#define RP2040_USBCTRL_REGS_USBPHY_DIRECT_OVERRIDE_TX_DP_OVERRIDE_EN            (1 << 7)
#define RP2040_USBCTRL_REGS_USBPHY_DIRECT_OVERRIDE_TX_DM_OE_OVERRIDE_EN         (1 << 6)
#define RP2040_USBCTRL_REGS_USBPHY_DIRECT_OVERRIDE_TX_DP_OE_OVERRIDE_EN         (1 << 5)
#define RP2040_USBCTRL_REGS_USBPHY_DIRECT_OVERRIDE_DM_PULLDN_EN_OVERRIDE_EN     (1 << 4)
#define RP2040_USBCTRL_REGS_USBPHY_DIRECT_OVERRIDE_DP_PULLDN_EN_OVERRIDE_EN     (1 << 3)
#define RP2040_USBCTRL_REGS_USBPHY_DIRECT_OVERRIDE_DP_PULLUP_EN_OVERRIDE_EN     (1 << 2)
#define RP2040_USBCTRL_REGS_USBPHY_DIRECT_OVERRIDE_DM_PULLUP_HISEL_OVERRIDE_EN  (1 << 1)
#define RP2040_USBCTRL_REGS_USBPHY_DIRECT_OVERRIDE_DP_PULLUP_HISEL_OVERRIDE_EN  (1 << 0)

#define RP2040_USBCTRL_REGS_USBPHY_TRIM_DM_PULLDN_TRIM_SHIFT                    (8)        /* Value to drive to USB PHY DM pulldown resistor trim control Experimental data suggests that the reset value will work, but this register allows adjustment if required */
#define RP2040_USBCTRL_REGS_USBPHY_TRIM_DM_PULLDN_TRIM_MASK                     (0x1f << RP2040_USBCTRL_REGS_USBPHY_TRIM_DM_PULLDN_TRIM_SHIFT)
#define RP2040_USBCTRL_REGS_USBPHY_TRIM_DP_PULLDN_TRIM_MASK                     (0x1f)     /* Value to drive to USB PHY DP pulldown resistor trim control Experimental data suggests that the reset value will work, but this register allows adjustment if required */

#define RP2040_USBCTRL_REGS_INTR_EP_STALL_NAK                                   (1 << 19)  /* Raised when any bit in EP_STATUS_STALL_NAK is set. Clear by clearing all bits in EP_STATUS_STALL_NAK. */
#define RP2040_USBCTRL_REGS_INTR_ABORT_DONE                                     (1 << 18)  /* Raised when any bit in ABORT_DONE is set. Clear by clearing all bits in ABORT_DONE. */
#define RP2040_USBCTRL_REGS_INTR_DEV_SOF                                        (1 << 17)  /* Set every time the device receives a SOF (Start of Frame) packet. Cleared by reading SOF_RD */
#define RP2040_USBCTRL_REGS_INTR_SETUP_REQ                                      (1 << 16)  /* Device. Source: SIE_STATUS.SETUP_REC */
#define RP2040_USBCTRL_REGS_INTR_DEV_RESUME_FROM_HOST                           (1 << 15)  /* Set when the device receives a resume from the host. Cleared by writing to SIE_STATUS.RESUME */
#define RP2040_USBCTRL_REGS_INTR_DEV_SUSPEND                                    (1 << 14)  /* Set when the device suspend state changes. Cleared by writing to SIE_STATUS.SUSPENDED */
#define RP2040_USBCTRL_REGS_INTR_DEV_CONN_DIS                                   (1 << 13)  /* Set when the device connection state changes. Cleared by writing to SIE_STATUS.CONNECTED */
#define RP2040_USBCTRL_REGS_INTR_BUS_RESET                                      (1 << 12)  /* Source: SIE_STATUS.BUS_RESET */
#define RP2040_USBCTRL_REGS_INTR_VBUS_DETECT                                    (1 << 11)  /* Source: SIE_STATUS.VBUS_DETECT */
#define RP2040_USBCTRL_REGS_INTR_STALL                                          (1 << 10)  /* Source: SIE_STATUS.STALL_REC */
#define RP2040_USBCTRL_REGS_INTR_ERROR_CRC                                      (1 << 9)   /* Source: SIE_STATUS.CRC_ERROR */
#define RP2040_USBCTRL_REGS_INTR_ERROR_BIT_STUFF                                (1 << 8)   /* Source: SIE_STATUS.BIT_STUFF_ERROR */
#define RP2040_USBCTRL_REGS_INTR_ERROR_RX_OVERFLOW                              (1 << 7)   /* Source: SIE_STATUS.RX_OVERFLOW */
#define RP2040_USBCTRL_REGS_INTR_ERROR_RX_TIMEOUT                               (1 << 6)   /* Source: SIE_STATUS.RX_TIMEOUT */
#define RP2040_USBCTRL_REGS_INTR_ERROR_DATA_SEQ                                 (1 << 5)   /* Source: SIE_STATUS.DATA_SEQ_ERROR */
#define RP2040_USBCTRL_REGS_INTR_BUFF_STATUS                                    (1 << 4)   /* Raised when any bit in BUFF_STATUS is set. Clear by clearing all bits in BUFF_STATUS. */
#define RP2040_USBCTRL_REGS_INTR_TRANS_COMPLETE                                 (1 << 3)   /* Raised every time SIE_STATUS.TRANS_COMPLETE is set. Clear by writing to this bit. */
#define RP2040_USBCTRL_REGS_INTR_HOST_SOF                                       (1 << 2)   /* Host: raised every time the host sends a SOF (Start of Frame). Cleared by reading SOF_RD */
#define RP2040_USBCTRL_REGS_INTR_HOST_RESUME                                    (1 << 1)   /* Host: raised when a device wakes up the host. Cleared by writing to SIE_STATUS.RESUME */
#define RP2040_USBCTRL_REGS_INTR_HOST_CONN_DIS                                  (1 << 0)   /* Host: raised when a device is connected or disconnected (i.e. when SIE_STATUS.SPEED changes). Cleared by writing to SIE_STATUS.SPEED */

#define RP2040_USBCTRL_REGS_INTE_EP_STALL_NAK                                   (1 << 19)  /* Raised when any bit in EP_STATUS_STALL_NAK is set. Clear by clearing all bits in EP_STATUS_STALL_NAK. */
#define RP2040_USBCTRL_REGS_INTE_ABORT_DONE                                     (1 << 18)  /* Raised when any bit in ABORT_DONE is set. Clear by clearing all bits in ABORT_DONE. */
#define RP2040_USBCTRL_REGS_INTE_DEV_SOF                                        (1 << 17)  /* Set every time the device receives a SOF (Start of Frame) packet. Cleared by reading SOF_RD */
#define RP2040_USBCTRL_REGS_INTE_SETUP_REQ                                      (1 << 16)  /* Device. Source: SIE_STATUS.SETUP_REC */
#define RP2040_USBCTRL_REGS_INTE_DEV_RESUME_FROM_HOST                           (1 << 15)  /* Set when the device receives a resume from the host. Cleared by writing to SIE_STATUS.RESUME */
#define RP2040_USBCTRL_REGS_INTE_DEV_SUSPEND                                    (1 << 14)  /* Set when the device suspend state changes. Cleared by writing to SIE_STATUS.SUSPENDED */
#define RP2040_USBCTRL_REGS_INTE_DEV_CONN_DIS                                   (1 << 13)  /* Set when the device connection state changes. Cleared by writing to SIE_STATUS.CONNECTED */
#define RP2040_USBCTRL_REGS_INTE_BUS_RESET                                      (1 << 12)  /* Source: SIE_STATUS.BUS_RESET */
#define RP2040_USBCTRL_REGS_INTE_VBUS_DETECT                                    (1 << 11)  /* Source: SIE_STATUS.VBUS_DETECT */
#define RP2040_USBCTRL_REGS_INTE_STALL                                          (1 << 10)  /* Source: SIE_STATUS.STALL_REC */
#define RP2040_USBCTRL_REGS_INTE_ERROR_CRC                                      (1 << 9)   /* Source: SIE_STATUS.CRC_ERROR */
#define RP2040_USBCTRL_REGS_INTE_ERROR_BIT_STUFF                                (1 << 8)   /* Source: SIE_STATUS.BIT_STUFF_ERROR */
#define RP2040_USBCTRL_REGS_INTE_ERROR_RX_OVERFLOW                              (1 << 7)   /* Source: SIE_STATUS.RX_OVERFLOW */
#define RP2040_USBCTRL_REGS_INTE_ERROR_RX_TIMEOUT                               (1 << 6)   /* Source: SIE_STATUS.RX_TIMEOUT */
#define RP2040_USBCTRL_REGS_INTE_ERROR_DATA_SEQ                                 (1 << 5)   /* Source: SIE_STATUS.DATA_SEQ_ERROR */
#define RP2040_USBCTRL_REGS_INTE_BUFF_STATUS                                    (1 << 4)   /* Raised when any bit in BUFF_STATUS is set. Clear by clearing all bits in BUFF_STATUS. */
#define RP2040_USBCTRL_REGS_INTE_TRANS_COMPLETE                                 (1 << 3)   /* Raised every time SIE_STATUS.TRANS_COMPLETE is set. Clear by writing to this bit. */
#define RP2040_USBCTRL_REGS_INTE_HOST_SOF                                       (1 << 2)   /* Host: raised every time the host sends a SOF (Start of Frame). Cleared by reading SOF_RD */
#define RP2040_USBCTRL_REGS_INTE_HOST_RESUME                                    (1 << 1)   /* Host: raised when a device wakes up the host. Cleared by writing to SIE_STATUS.RESUME */
#define RP2040_USBCTRL_REGS_INTE_HOST_CONN_DIS                                  (1 << 0)   /* Host: raised when a device is connected or disconnected (i.e. when SIE_STATUS.SPEED changes). Cleared by writing to SIE_STATUS.SPEED */

#define RP2040_USBCTRL_REGS_INTF_EP_STALL_NAK                                   (1 << 19)  /* Raised when any bit in EP_STATUS_STALL_NAK is set. Clear by clearing all bits in EP_STATUS_STALL_NAK. */
#define RP2040_USBCTRL_REGS_INTF_ABORT_DONE                                     (1 << 18)  /* Raised when any bit in ABORT_DONE is set. Clear by clearing all bits in ABORT_DONE. */
#define RP2040_USBCTRL_REGS_INTF_DEV_SOF                                        (1 << 17)  /* Set every time the device receives a SOF (Start of Frame) packet. Cleared by reading SOF_RD */
#define RP2040_USBCTRL_REGS_INTF_SETUP_REQ                                      (1 << 16)  /* Device. Source: SIE_STATUS.SETUP_REC */
#define RP2040_USBCTRL_REGS_INTF_DEV_RESUME_FROM_HOST                           (1 << 15)  /* Set when the device receives a resume from the host. Cleared by writing to SIE_STATUS.RESUME */
#define RP2040_USBCTRL_REGS_INTF_DEV_SUSPEND                                    (1 << 14)  /* Set when the device suspend state changes. Cleared by writing to SIE_STATUS.SUSPENDED */
#define RP2040_USBCTRL_REGS_INTF_DEV_CONN_DIS                                   (1 << 13)  /* Set when the device connection state changes. Cleared by writing to SIE_STATUS.CONNECTED */
#define RP2040_USBCTRL_REGS_INTF_BUS_RESET                                      (1 << 12)  /* Source: SIE_STATUS.BUS_RESET */
#define RP2040_USBCTRL_REGS_INTF_VBUS_DETECT                                    (1 << 11)  /* Source: SIE_STATUS.VBUS_DETECT */
#define RP2040_USBCTRL_REGS_INTF_STALL                                          (1 << 10)  /* Source: SIE_STATUS.STALL_REC */
#define RP2040_USBCTRL_REGS_INTF_ERROR_CRC                                      (1 << 9)   /* Source: SIE_STATUS.CRC_ERROR */
#define RP2040_USBCTRL_REGS_INTF_ERROR_BIT_STUFF                                (1 << 8)   /* Source: SIE_STATUS.BIT_STUFF_ERROR */
#define RP2040_USBCTRL_REGS_INTF_ERROR_RX_OVERFLOW                              (1 << 7)   /* Source: SIE_STATUS.RX_OVERFLOW */
#define RP2040_USBCTRL_REGS_INTF_ERROR_RX_TIMEOUT                               (1 << 6)   /* Source: SIE_STATUS.RX_TIMEOUT */
#define RP2040_USBCTRL_REGS_INTF_ERROR_DATA_SEQ                                 (1 << 5)   /* Source: SIE_STATUS.DATA_SEQ_ERROR */
#define RP2040_USBCTRL_REGS_INTF_BUFF_STATUS                                    (1 << 4)   /* Raised when any bit in BUFF_STATUS is set. Clear by clearing all bits in BUFF_STATUS. */
#define RP2040_USBCTRL_REGS_INTF_TRANS_COMPLETE                                 (1 << 3)   /* Raised every time SIE_STATUS.TRANS_COMPLETE is set. Clear by writing to this bit. */
#define RP2040_USBCTRL_REGS_INTF_HOST_SOF                                       (1 << 2)   /* Host: raised every time the host sends a SOF (Start of Frame). Cleared by reading SOF_RD */
#define RP2040_USBCTRL_REGS_INTF_HOST_RESUME                                    (1 << 1)   /* Host: raised when a device wakes up the host. Cleared by writing to SIE_STATUS.RESUME */
#define RP2040_USBCTRL_REGS_INTF_HOST_CONN_DIS                                  (1 << 0)   /* Host: raised when a device is connected or disconnected (i.e. when SIE_STATUS.SPEED changes). Cleared by writing to SIE_STATUS.SPEED */

#define RP2040_USBCTRL_REGS_INTS_EP_STALL_NAK                                   (1 << 19)  /* Raised when any bit in EP_STATUS_STALL_NAK is set. Clear by clearing all bits in EP_STATUS_STALL_NAK. */
#define RP2040_USBCTRL_REGS_INTS_ABORT_DONE                                     (1 << 18)  /* Raised when any bit in ABORT_DONE is set. Clear by clearing all bits in ABORT_DONE. */
#define RP2040_USBCTRL_REGS_INTS_DEV_SOF                                        (1 << 17)  /* Set every time the device receives a SOF (Start of Frame) packet. Cleared by reading SOF_RD */
#define RP2040_USBCTRL_REGS_INTS_SETUP_REQ                                      (1 << 16)  /* Device. Source: SIE_STATUS.SETUP_REC */
#define RP2040_USBCTRL_REGS_INTS_DEV_RESUME_FROM_HOST                           (1 << 15)  /* Set when the device receives a resume from the host. Cleared by writing to SIE_STATUS.RESUME */
#define RP2040_USBCTRL_REGS_INTS_DEV_SUSPEND                                    (1 << 14)  /* Set when the device suspend state changes. Cleared by writing to SIE_STATUS.SUSPENDED */
#define RP2040_USBCTRL_REGS_INTS_DEV_CONN_DIS                                   (1 << 13)  /* Set when the device connection state changes. Cleared by writing to SIE_STATUS.CONNECTED */
#define RP2040_USBCTRL_REGS_INTS_BUS_RESET                                      (1 << 12)  /* Source: SIE_STATUS.BUS_RESET */
#define RP2040_USBCTRL_REGS_INTS_VBUS_DETECT                                    (1 << 11)  /* Source: SIE_STATUS.VBUS_DETECT */
#define RP2040_USBCTRL_REGS_INTS_STALL                                          (1 << 10)  /* Source: SIE_STATUS.STALL_REC */
#define RP2040_USBCTRL_REGS_INTS_ERROR_CRC                                      (1 << 9)   /* Source: SIE_STATUS.CRC_ERROR */
#define RP2040_USBCTRL_REGS_INTS_ERROR_BIT_STUFF                                (1 << 8)   /* Source: SIE_STATUS.BIT_STUFF_ERROR */
#define RP2040_USBCTRL_REGS_INTS_ERROR_RX_OVERFLOW                              (1 << 7)   /* Source: SIE_STATUS.RX_OVERFLOW */
#define RP2040_USBCTRL_REGS_INTS_ERROR_RX_TIMEOUT                               (1 << 6)   /* Source: SIE_STATUS.RX_TIMEOUT */
#define RP2040_USBCTRL_REGS_INTS_ERROR_DATA_SEQ                                 (1 << 5)   /* Source: SIE_STATUS.DATA_SEQ_ERROR */
#define RP2040_USBCTRL_REGS_INTS_BUFF_STATUS                                    (1 << 4)   /* Raised when any bit in BUFF_STATUS is set. Clear by clearing all bits in BUFF_STATUS. */
#define RP2040_USBCTRL_REGS_INTS_TRANS_COMPLETE                                 (1 << 3)   /* Raised every time SIE_STATUS.TRANS_COMPLETE is set. Clear by writing to this bit. */
#define RP2040_USBCTRL_REGS_INTS_HOST_SOF                                       (1 << 2)   /* Host: raised every time the host sends a SOF (Start of Frame). Cleared by reading SOF_RD */
#define RP2040_USBCTRL_REGS_INTS_HOST_RESUME                                    (1 << 1)   /* Host: raised when a device wakes up the host. Cleared by writing to SIE_STATUS.RESUME */
#define RP2040_USBCTRL_REGS_INTS_HOST_CONN_DIS                                  (1 << 0)   /* Host: raised when a device is connected or disconnected (i.e. when SIE_STATUS.SPEED changes). Cleared by writing to SIE_STATUS.SPEED */

#endif /* __ARCH_ARM_SRC_RP2040_HARDWARE_RP2040_USBCTRL_REGS_H */
